#+Title:     Environment
#+Author:    Adolfo De Unánue
#+Email:     adolfo.deunanue@itam.mx
#+DATE:      2017
#+DESCRIPTION: General discussion about the issues to be solve in order to build the product
#+KEYWORDS:  data product 
#+LANGUAGE:  en

#+STARTUP: beamer
#+STARUP: oddeven

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [presentation, smaller]

#+BEAMER_THEME: DarkConsole

#+OPTIONS: H:1 toc:nil 

#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport

#+COLUMNS: %20ITEM %13BEAMER_env(Env) %6BEAMER_envargs(Args) %4BEAMER_col(Col) %7BEAMER_extra(Extra)

* Checklist

- Si no lo instalaron:
  - https://docs.docker.com/engine/installation/

- Si ya lo instalaron, verifiquen:

#+begin_src shell :results verbatim drawer
docker --version
#+end_src

#+RESULTS:
:RESULTS:
Docker version 1.13.1, build 092cba3
:END:


* Comandos útiles

Revisar las imágenes

#+begin_src shell :results verbatim drawer
docker images | head 
#+end_src

#+RESULTS:
:RESULTS:
REPOSITORY               TAG                 IMAGE ID            CREATED             SIZE
dummy/test-pyspark       latest              31b82821c1d3        3 weeks ago         1.26 GB
dummy/test-python        latest              406f669d080d        3 weeks ago         1.52 GB
dummy/test-r             latest              cb04e0c04c01        3 weeks ago         764 MB
:END:

* Comandos útiles

Revisar los contenedores

#+begin_src shell :results verbatim drawer
docker ps -a | head 
#+end_src

#+RESULTS:
:RESULTS:
CONTAINER ID        IMAGE               COMMAND             CREATED             STATUS              PORTS               NAMES
:END:

* Docker compose: Instalación

- Damos permisos de ejecución

#+begin_example
chmod +x /usr/local/bin/docker-compose
#+end_example

- Y probamos
  - Aunque estén en ~Mac OS X~.

#+begin_src shell  :results verbatim drawer
docker-compose --version
#+end_src
#+RESULTS:
:RESULTS:
docker-compose version 1.9.0, build 2585387
:END:


* Docker compose: Uso

- Para ver que servicios están ejecutándose

#+begin_src shell :results verbatim drawer
docker-compose ps
#+end_src

#+RESULTS:
:RESULTS:
:END:

- Para construir los contenedores:

#+begin_src shell :eval never
docker-compose build
#+end_src

- Para levantarlos:

#+begin_src shell :eval never
docker-compose up -d
#+end_src


